IRP/src/InformationRegisters/AddProperties/AddProperties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AddProperties</name>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.AddAttributeAndProperty</types>
    </type>
  </resources>
  <dimensions>
    <name>Object</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Property</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/AddAttributeAndPropertySets/AddAttributeAndPropertySets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AddAttributeAndPropertySets</name>
  <predefined>
    <items>
      <name>Catalog_ItemKeys</name>
    </items>
    <items>
      <name>Catalog_Items</name>
    </items>
    <items>
      <name>Catalog_ItemTypes</name>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
    </items>
    <items>
      <name>Catalog_Boxes</name>
      <description>Catalog boxes</description>
    </items>
    <items>
      <name>Catalog_Partners</name>
      <description>Catalog partners</description>
    </items>
    <items>
      <name>Catalog_ExpenseAndRevenueTypes</name>
      <description>Catalog expense and revenue types</description>
    </items>
    <items>
      <name>Catalog_BusinessUnits</name>
      <description>Catalog business units</description>
    </items>
    <items>
      <name>Catalog_PriceKeys</name>
      <description>Catalog price keys</description>
    </items>
    <items>
      <name>Document_SalesOrder</name>
      <description>Document sales order</description>
    </items>
    <items>
      <name>Catalog_ChequeBonds</name>
      <description>Cheque bonds</description>
    </items>
    <items>
      <name>Catalog_Specifications</name>
      <description>Catalog specifications</description>
    </items>
    <items>
      <name>Document_PurchaseInvoice</name>
      <description>Document purchase invoice</description>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
      <description>Document purchase order</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Attributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InterfaceGroup</name>
      <comment>Name of group for attribute</comment>
      <type>
        <types>CatalogRef.InterfaceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonForms/EditAddProperties/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Ref = Parameters.Ref;
	
	AddAttributeAndPropertySet = AddAttributesAndPropertiesServer.AddAttributeAndPropertySetRef(Ref);
	
	Query = New Query();
	Query.Text =
		"SELECT
		|	AddAttributeAndPropertySetsProperties.Property
		|INTO Properties
		|FROM
		|	Catalog.AddAttributeAndPropertySets.Properties AS AddAttributeAndPropertySetsProperties
		|WHERE
		|	AddAttributeAndPropertySetsProperties.Ref = &AddAttributeAndPropertySets
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	AddProperties.Value,
		|	Properties.Property
		|FROM
		|	Properties AS Properties
		|		LEFT JOIN InformationRegister.AddProperties AS AddProperties
		|		ON Properties.Property = AddProperties.Property
		|		AND AddProperties.Object = &Object";
	Query.SetParameter("Object", ThisObject.Ref);
	Query.SetParameter("AddAttributeAndPropertySets", AddAttributeAndPropertySet);
	Query.SetParameter("Properties", ThisObject.Properties.Unload());
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	ThisObject.Properties.Load(QueryTable);
	
	For Each Row In ThisObject.Properties Do
		AttributeStructure = New Structure("Attribute, InterfaceGroup", Row.Property, Undefined);
		PropertyInfo = AddAttributesAndPropertiesServer.AttributeAndPropertyInfo(AttributeStructure);
		Row.TypeDef = PropertyInfo.Type;
	EndDo;
	
EndProcedure

&AtClient
Procedure PropertiesBeforeRowChange(Item, Cancel)
	CurrentData = ThisObject.Items.Properties.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ArrayOfSelectionArgs = New Array();
	If CurrentData.TypeDef.ContainsType(Type("CatalogRef.AddAttributeAndPropertyValues")) Then
		ArrayOfSelectionArgs.Add(New ChoiceParameter("Filter.Owner", CurrentData.Property));
	EndIf;
	ThisObject.Items.PropertiesValue.ChoiceParameters = New FixedArray(ArrayOfSelectionArgs);
EndProcedure

&AtClient
Procedure PropertiesOnStartEdit(Item, NewRow, Clone)
	If Item.CurrentData.Value = Undefined Then
		Item.ChildItems.PropertiesValue.TypeRestriction = Item.CurrentData.TypeDef;
	EndIf;
EndProcedure

&AtClient
Procedure Save(Command)
	SaveAtServer();
EndProcedure

&AtClient
Procedure SaveAndClose(Command)
	SaveAtServer();
	ThisObject.Close();
EndProcedure

&AtServer
Procedure SaveAtServer()
	RecordSet = InformationRegisters.AddProperties.CreateRecordSet();
	RecordSet.Filter.Object.Set(ThisObject.Ref);
	ValueTable = ThisObject.Properties.Unload();
	ValueTable.Columns.Add("Object");
	ValueTable.FillValues(ThisObject.Ref, "Object");
	
	ArrayForDelete = New Array();
	For Each Row In ValueTable Do
		If Not ValueIsFilled(Row.Value) Then
			ArrayForDelete.Add(Row);
		EndIf;
	EndDo;
	For Each Item In ArrayForDelete Do
		ValueTable.Delete(Item);
	EndDo;
	
	RecordSet.Load(ValueTable);
	RecordSet.Write();
EndProcedure

&AtClient
Procedure PropertiesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure PropertiesBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure
